/**************************************************************************************
 **** Copyright (C), 2017, xx xx xx xx info&tech Co., Ltd.

 * File Name     : vehic.h
 * Author        :
 * Date          : 2017-03-15
 * Description   : .C file function description
 * Version       : 1.0
**************************************************************************************/
#ifndef __VEHIC_H__
#define __VEHIC_H__

/**************************************************************************************
* Description    : 车辆速度对应引脚
**************************************************************************************/
#define GPIO_ACC                                          15   // ACC,PA15,pin40
#define SPEED1_IRQ                                        14   // SPEED1,PG1,pin97
#define SPEED2_IRQ                                        6    // SPEED1,PC3,pin116

/**************************************************************************************
* Description    : 速度采集时间相关
**************************************************************************************/
#define PULSE_CALC_MS                100                     // 频率计算毫秒时间
#define PULSE_MAX                    (1000/PULSE_CALC_MS)    // 脉冲计数个数
#define UPLOAD_DEFAULT_TICK          200                     // 默认上报间隔200ms

/**************************************************************************************
* Description    : 车辆速度结构定义
**************************************************************************************/
struct vehic {
    uint32_t pulse_cnt;                              // 脉冲计数器
    uint32_t pulse_arry[PULSE_MAX];                  // 脉冲滤波数组
    uint32_t pulse_index;                            // 脉冲索引
    uint32_t pulse_freq;                             // 脉冲频率
    uint32_t total_pulse;                            // 总脉冲数
    uint32_t irq;                                    // 指向产生速度中断的IRQ信息
};

#endif /* __VEHIC_H__ */

