/**************************************************************************************
 **** Copyright (C), 2017, xx xx xx xx info&tech Co., Ltd.

 * File Name     : st7567_font.h
 * Author        :
 * Date          : 2017-03-15
 * Description   : .C file function description
 * Version       : 1.0
**************************************************************************************/
#ifndef __ST7567_FONT_H__
#define __ST7567_FONT_H__

#include "frtos_types.h"

/**************************************************************************************
* Description    : 模块宏数据定义
**************************************************************************************/
#define ST7567_FONT_WIDE           16
#define ST7567_FONT_HIGH           16

/**************************************************************************************
* Description    : 汉字字模表(从左到右从上到下, 纵向取模上高位)
**************************************************************************************/
struct utf8_16x16_t {
    uint8_t index[4];                      // UTF8内码索引
    uint8_t dot[32];                       // 点阵码数据
};

/**************************************************************************************
* FunctionName   : lcm_font_utf8_get_dot()
* Description    : ST7567,获取UTF8字符的字库点阵地址
* EntryParameter : utf8,UTF8字符索引
* ReturnValue    : 返回点阵数据指针,NULL(失败)
**************************************************************************************/
const uint8_t *st7567_font_utf8_get_dot(uint8_t *utf8);

/**************************************************************************************
* FunctionName   : lcm_font_write_utf8_str()
* Description    : Lcm写UTF8字符串
* EntryParameter : *addr,字符串写入起始地址, str,要写的字符串
* ReturnValue    : 0,成功, -1,失败
**************************************************************************************/
int8_t st7567_font_write_utf8_str(struct st7567_addr_s *addr, uint8_t *str);

#endif /* __ST7567_FONT_H__ */

